#include <iostream>
using namespace std;

//Создание структуры:
struct Point
{
	//Структура Point описывает точки на плоскости
	double x; //Координата по X
	double y; // Координата по Y
};

// Создавая структуру или класс, мы создаем новый тип данных, 
// а объявляя объекты этого класса или структры мы создаем переменные нашего типа.
// Классы и структуры еще называют пользовательскими типами данных.

// КЛАСС - ЭТО ТИП ДАННЫХ.
// СТРУКТУРА - ЭТО ТОЖЕ ТИП ДАННЫХ.
// ОБЪЕКТ - САМАЯ ОБЫЧНАЯ ПЕРЕМЕННАЯ. 

void main()
{
	setlocale(LC_ALL, "Rus");
	int a; // Объявление перпеменной 'a', типа int 
	Point A; // Объявление объекта 'A' структуры 'Point' 
			 //Объявление переменной 'A' типа Point

}